quiz_info = [
    {},
    {
        "voice": '1.m4a',
        "description": 'دستـور الــعمل آزمــون\nکاربر گرامی؛\nآزمون پیش رو از چهار بخش مجزا تشکیل شده که لازم است هر کدام از آنها در زمان هایی که گفته شده، انجام شود. سوالات این آزمون از آسان به دشوار تنظیم شده، در آخر هر بخش تعدادی سوال بسیار دشوار وجود دارد، به طوری که کمتر کسی می تواند در مدت تعیین شده به آنها پاسخ بدهد. با این حال تا آنجا که می توانید تلاش کنید و به تعداد بیشتری از سوالات پاسخ دهید.\nتوجه داشته باشید که برای پاسخ های غلط، نمره منفی در نظر گرفته نشده است. بنابراین بهتر است به همه سوالات پاسخ دهید.\nبه منظور فهم بهتر دستورالعمل آزمون، در ابتدای هر بخش سوال هایی به عنوان مثال مورد بررسی قرار می گیرد. لطفاً این مثال ها را با دقت بخوانید.',
    },
    {
        "voice": '2.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی هوش های چندگانه شما تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی موضوعی درباره شما می پردازد. بنابراین به هر سوال آن گونه که هستید پاسخ دهید. به شما توصیه می گردد از پاسخ دادن به سوالات با گزینه "متوسط" اجتناب کنید و اگر موضوع مورد بحث برای شما حتما در حد متوسط بود از این گزینه استفاده کنید و در غیر این صورت تلاش کنید هر سوال را در طیف بیان شده درباره خود تحلیل و ارزیابی کرده و گزینه مناسب را انتخاب کنید.',
    },
    {
        "voice": '3.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی برخی از ابعاد شخصیت شما تهیه شده است، در این آزمون سوال درست و غلط وجود ندارد و هر سوال به بررسی موضوعی درباره شما می پردازد. پاسخ های شما به این سوالات به صورت کاملا محرمانه باقی می ماند و بنابراین به هر سوال آن گونه که هستید پاسخ دهید. به شما توصیه می گردد از پاسخ دادن به سوالات با گزینه "نه موافقم و نه مخالفم" اجتناب کنید و اگر موضوع مورد بحث برای شما حتما در حد متوسط بود از این گزینه استفاده کنید و در غیر این صورت تلاش کنید هر سوال را در طیف بیان شده درباره خود تحلیل و ارزیابی کرده و گزینه مناسب را انتخاب کنید.',
    },
    {
        "voice": '4.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی برخی از استعدادهای شما تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی موضوعی درباره شما می پردازد.در این پرسشنامه در یک سر طیف یک جمله و در طرف مقابل جمله ای نسبتا مخالف و یا متفاوت با آن مطرح شده است. با بررسی هر دو جمله، گزینه ای که به بهترین شکل شما را توصیف می کند انتخاب کنید. پاسخ های شما به این سوالات به صورت کاملا محرمانه باقی می ماند و بنابراین به هر سوال آن گونه که هستید پاسخ دهید. به شما توصیه می گردد از پاسخ دادن به سوالات با گزینه "متوسط" اجتناب کنید و اگر موضوع مورد بحث برای شما حتما در حد متوسط بود از این گزینه استفاده کنید و در غیر این صورت تلاش کنید هر سوال را در طیف بیان شده درباره خود تحلیل و ارزیابی کرده و گزینه مناسب را انتخاب کنید.',
    },
    {
        "voice": '5.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی برخی از استعدادهای شما تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی موضوعی درباره شما می پردازد. این پرسشنامه از 5 بخش تشکیل شده است که در ابتدای هر بخش دستورالعمل  آن قسمت توضیح داده شده است. با توجه به دستورالعمل بیان شده پاسخ های مناسب برای هر بخش را تعیین کنید.',
    },
    {
        "voice": '6.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی نظرات شما پیرامون تحصیل و درس تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی بخشی از این موضوعی درباره شما می پردازد. این پرسشنامه از 2 بخش تشکیل شده است که در ابتدای هر بخش دستورالعمل  آن قسمت توضیح داده شده است. پاسخ های شما در این پرسشنامه نیز به صورت کاملا محرمانه باقی می ماند بنابراین گزینه را انتخاب کنید که به بهترین شکل شما را توصیف می کند.',
    },
    {
        "voice": '7.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی انگیزه شما پیرامون تحصیل و درس تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی بخشی از این موضوعی درباره شما می پردازد. پاسخ های شما در این پرسشنامه نیز به صورت کاملا محرمانه باقی می ماند بنابراین گزینه را انتخاب کنید که به بهترین شکل شما را توصیف می کند.',
    }
]

quiz_table_info = [
    {
        'id': 1,
        'quizName': "کتل",
        "voice": '1.m4a',
        "description": 'دستـور الــعمل آزمــون\nکاربر گرامی؛\nآزمون پیش رو از چهار بخش مجزا تشکیل شده که لازم است هر کدام از آنها در زمان هایی که گفته شده، انجام شود. سوالات این آزمون از آسان به دشوار تنظیم شده، در آخر هر بخش تعدادی سوال بسیار دشوار وجود دارد، به طوری که کمتر کسی می تواند در مدت تعیین شده به آنها پاسخ بدهد. با این حال تا آنجا که می توانید تلاش کنید و به تعداد بیشتری از سوالات پاسخ دهید.\nتوجه داشته باشید که برای پاسخ های غلط، نمره منفی در نظر گرفته نشده است. بنابراین بهتر است به همه سوالات پاسخ دهید.\nبه منظور فهم بهتر دستورالعمل آزمون، در ابتدای هر بخش سوال هایی به عنوان مثال مورد بررسی قرار می گیرد. لطفاً این مثال ها را با دقت بخوانید.',
        "pic": "default.png"
    },
    {
        'id': 2,
        'quizName': "گاردنر",
        "voice": '2.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی هوش های چندگانه شما تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی موضوعی درباره شما می پردازد. بنابراین به هر سوال آن گونه که هستید پاسخ دهید. به شما توصیه می گردد از پاسخ دادن به سوالات با گزینه "متوسط" اجتناب کنید و اگر موضوع مورد بحث برای شما حتما در حد متوسط بود از این گزینه استفاده کنید و در غیر این صورت تلاش کنید هر سوال را در طیف بیان شده درباره خود تحلیل و ارزیابی کرده و گزینه مناسب را انتخاب کنید.',
        "pic": "default.png"
    },
    {
        'id': 3,
        'quizName': "نئو",
        "voice": '3.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی برخی از ابعاد شخصیت شما تهیه شده است، در این آزمون سوال درست و غلط وجود ندارد و هر سوال به بررسی موضوعی درباره شما می پردازد. پاسخ های شما به این سوالات به صورت کاملا محرمانه باقی می ماند و بنابراین به هر سوال آن گونه که هستید پاسخ دهید. به شما توصیه می گردد از پاسخ دادن به سوالات با گزینه "نه موافقم و نه مخالفم" اجتناب کنید و اگر موضوع مورد بحث برای شما حتما در حد متوسط بود از این گزینه استفاده کنید و در غیر این صورت تلاش کنید هر سوال را در طیف بیان شده درباره خود تحلیل و ارزیابی کرده و گزینه مناسب را انتخاب کنید.',
        "pic": "default.png"
    },
    {
        'id': 4,
        'quizName': "کلیفتون",
        "voice": '4.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی برخی از استعدادهای شما تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی موضوعی درباره شما می پردازد.در این پرسشنامه در یک سر طیف یک جمله و در طرف مقابل جمله ای نسبتا مخالف و یا متفاوت با آن مطرح شده است. با بررسی هر دو جمله، گزینه ای که به بهترین شکل شما را توصیف می کند انتخاب کنید. پاسخ های شما به این سوالات به صورت کاملا محرمانه باقی می ماند و بنابراین به هر سوال آن گونه که هستید پاسخ دهید. به شما توصیه می گردد از پاسخ دادن به سوالات با گزینه "متوسط" اجتناب کنید و اگر موضوع مورد بحث برای شما حتما در حد متوسط بود از این گزینه استفاده کنید و در غیر این صورت تلاش کنید هر سوال را در طیف بیان شده درباره خود تحلیل و ارزیابی کرده و گزینه مناسب را انتخاب کنید.',
        "pic": "default.png"
    },
    {
        'id': 5,
        'quizName': "هالند",
        "voice": '5.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی برخی از استعدادهای شما تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی موضوعی درباره شما می پردازد. این پرسشنامه از 5 بخش تشکیل شده است که در ابتدای هر بخش دستورالعمل  آن قسمت توضیح داده شده است. با توجه به دستورالعمل بیان شده پاسخ های مناسب برای هر بخش را تعیین کنید.',
        "pic": "default.png"
    },
    {
        'id': 6,
        'quizName': "تعهد",
        "voice": '6.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی نظرات شما پیرامون تحصیل و درس تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی بخشی از این موضوعی درباره شما می پردازد. این پرسشنامه از 2 بخش تشکیل شده است که در ابتدای هر بخش دستورالعمل  آن قسمت توضیح داده شده است. پاسخ های شما در این پرسشنامه نیز به صورت کاملا محرمانه باقی می ماند بنابراین گزینه را انتخاب کنید که به بهترین شکل شما را توصیف می کند.',
        "pic": "default.png"
    },
    {
        'id': 7,
        'quizName': "پرسشنامه",
        "voice": '7.m4a',
        "description": 'دستـور الــعمل آزمــون\nپرسشنامه پیش رو به منظور بررسی انگیزه شما پیرامون تحصیل و درس تهیه شده است، در این پرسشنامه سوال درست و غلط وجود ندارد و هر سوال به بررسی بخشی از این موضوعی درباره شما می پردازد. پاسخ های شما در این پرسشنامه نیز به صورت کاملا محرمانه باقی می ماند بنابراین گزینه را انتخاب کنید که به بهترین شکل شما را توصیف می کند.',
        "pic": "default.png"
    }
]


def get_quiz_info(quiz_id):
    return quiz_info[quiz_id]


def get_quiz_table_info():
    return quiz_table_info
