# The CATEL quiz info needed
catel_data = [(
    "این نمره به این معناست که هوش شما در مرتبه خوبی قرار دارد و از 98 درصد افراد جامعه بالاتر است، بنابراین هوش برای شما محدود کننده نیست و شما از این منظر توانایی موفق شدن در هر رشته تحصیلی و شغلی را دارا می‌باشید، تنها محدود کننده‌ای که می‌تواند ادامه تحصیل شما در رشته‌های برجسته و دشوار را با چالش مواجه کند، استمرار و تلاش شما برای رسیدن به اهداف خود می‌باشد",
    4), (
    "نمره شما از 90 درصد افراد جامعه بالاتر است. این بهره هوشی، به این معناست که هوش برای شما محدود کننده نیست و شما از این منظر توانایی موفق شدن در هر رشته تحصیلی و شغلی را دارا می‌باشید، تنها محدود کننده‌ای که می‌تواند ادامه تحصیل شما در رشته‌های برجسته و دشوار را با چالش مواجه کند، استمرار و تلاش شما برای رسیدن به اهداف خود می‌باشد.",
    3), (
    "نمره شما از 80 درصد افراد جامعه بالاتر است. این بهره هوشی، به این معناست که هوش برای شما محدود کننده نیست و شما از این منظر توانایی موفق شدن در هر رشته تحصیلی و شغلی را دارا می‌باشید، تنها محدود کننده‌ای که می‌تواند ادامه تحصیل شما در رشته‌های برجسته و دشوار را با چالش مواجه کند، استمرار و تلاش شما برای رسیدن به اهداف خود می‌باشد",
    2), (
    "نمره شما از 50 درصد افراد جامعه بالاتر است. این بهره هوشی، به این معناست که محدود کننده‌ای که می‌تواند ادامه تحصیل شما در رشته‌های برجسته و دشوار را با چالش مواجه کند، استمرار و تلاش شما برای رسیدن به اهداف خود می‌باشد",
    1), (
    "نمره شما از 30 درصد افراد جامعه بالاتر است. توصیه به شما این است که در ورود به رشته‌ها و مشاغل ذهنی دشوار با احتیاط عمل نمایید.",
    0), (
    "این نمره نشان دهنده این است که یا برای آزمون زمان کافی نگذاشته‌اید و سوالات را به صورت تصادفی پاسخ داده‌اید یا در پاسخ دهی به سوالات دقت کافی به خرج نداده‌اید. در هر صورت به شما توصیه می‌گردد از ورود به رشته‌ها و مشاغلی که نیاز به دقت بالا دارند و سطح دشواری بالایی دارند اجتناب کنید.",
    -1)]


def get_iq_name(iq_score):
    if iq_score >= 164:
        return 0, 'نابغه سرآمد'
    elif 148 <= iq_score <= 163:
        return 1, 'نابغه'
    elif 132 <= iq_score <= 147:
        return 2, 'تیزهوش'
    elif 120 <= iq_score <= 131:
        return 3, 'باهوش'
    elif 110 <= iq_score <= 119:
        return 4, 'متوسط قوی'
    elif 90 <= iq_score <= 109:
        return 5, 'متوسط'
    elif 68 <= iq_score <= 89:
        return 6, 'مرزی'
    elif 52 <= iq_score <= 67:
        return 7, 'آموزش پذیر'
    elif 36 <= iq_score <= 51:
        return 8, 'تربیت پذیر'
    else:
        return 9, 'حمایت پذیر'


def catel_info(iq_score):
    iq_name = get_iq_name(iq_score)
    first_sentnces = 'همانطور که مشاهده کرده‌اید بهره هوشی شما در دسته افراد ' + iq_name[1] + ' قرار دارد.'
    if iq_score >= 132:
        return first_sentnces + catel_data[0][0], catel_data[0][1], iq_name[1], iq_name[0]
    if 120 <= iq_score <= 131:
        return first_sentnces + catel_data[1][0], catel_data[1][1], iq_name[1], iq_name[0]
    if 119 <= iq_score <= 110:
        return first_sentnces + catel_data[2][0], catel_data[2][1], iq_name[1], iq_name[0]
    if 109 <= iq_score <= 100:
        return first_sentnces + catel_data[3][0], catel_data[3][1], iq_name[1], iq_name[0]
    if 99 <= iq_score <= 85:
        return first_sentnces + catel_data[4][0], catel_data[4][1], iq_name[1], iq_name[0]
    else:
        return first_sentnces + catel_data[5][0], catel_data[5][1], iq_name[1], iq_name[0]


# The GARDNER quiz info needed

def get_tube_char_color(score):
    if 10 <= score <= 17:
        return "#42b74a"
    elif 17 < score <= 25:
        return "#cfdf28"
    elif 25 < score <= 34:
        return "#ffbb10"
    elif 34 < score <= 42:
        return "#f76420"
    elif 42 < score <= 50:
        return "#cf2020"


def gardner_visual_explain(score):
    first_sentence = "نمره کسب شده توسط شما در این مقیاس " + str(round(score / 50 * 100)) + " می‌باشد،"
    if 10 <= score <= 17:
        return first_sentence + " که نمره بسیار کمی‌است. این نمره بیانگر این است که احتمالا هوش تصویری - فضایی جزو ویژگی‌های برجسته شما نمی‌باشد، این بدین معناست که تجسم و تصویر سازی و بررسی سه بعدی اجسام برای شما چندان آسان نیست. بنابراین به شما توصیه میشود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت و استعداد دارند اجتناب کنید، زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 17 < score <= 25:
        return first_sentence + "که نمره کمی‌است. این نمره بیانگر این است که احتمالا هوش تصویری - فضایی جزو ویژگی‌های برجسته شما نمی‌باشد، و این بدین معناست که تجسم و تصویر سازی و بررسی سه بعدی اجسام برای شما چندان آسان نیست. بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت و استعداد دارند اجتناب کنید، زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 25 < score <= 34:
        return first_sentence + " که نمره قابل قبولی می‌باشد. این بدین معناست که تجسم و تصویر سازی و بررسی سه بعدی اجسام برای شما چندان مشکل نیست، بنابراین شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت و استعداد دارند را در حوزه فعالیت خود قراردهید، زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. در صورت ورود به مشاغلی که نیاز زیادی به این ویژگی دارند به شما توصیه می‌گردد حتما برای تقویت این استعداد برنامه ریزی لازم را داشته باشید."
    elif 34 < score <= 42:
        return first_sentence + " که نمره بالایی می‌باشد. این نمره بیانگر آن است که هوش تصویری - فضایی جزو ویژگی‌های مثبت شما می‌باشد و این بدین معناست که تجسم و تصویر سازی و بررسی سه بعدی اجسام برای شما آسان است. شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت و استعداد دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."
    elif 42 < score <= 50:
        return first_sentence + " که نمره بسیار بالایی می‌باشد. این نمره بیانگر آن است که هوش تصویری - فضایی جزو ویژگی‌های برجسته شما می‌باشد و این بدین معناست که تجسم و تصویر سازی و بررسی سه بعدی اجسام برای شما آسان است. شما میتوانید  تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."


def gardner_linguistic_explain(score):
    first_sentence = "نمره کسب شده توسط شما در این مقیاس " + str(round(score / 50 * 100)) + " می‌باشد،"
    if 10 <= score <= 17:
        return first_sentence + " که نمره بسیار کمی‌است. این نمره بیانگر این است که احتمالا هوش زبانی - کلامی‌جزو ویژگی‌های برجسته شما نمی‌باشد و این بدین معناست که سخنرانی، معنا شناسی ، استفاده از دستور زبان و کاربرد لغات برای شما چندان آسان نیست، بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به مهارت‌های زبانی و ارتباطی دارند اجتناب کنید. فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 17 < score <= 25:
        return first_sentence + " که نمره کمی‌است. این نمره بیانگر این است که احتمالا هوش زبانی - کلامی‌جزو ویژگی‌های برجسته شما نمی‌باشد. به عبارت دیگر، سخنرانی، معنا شناسی ، استفاده از دستور زبان و کاربرد لغات برای شماچندان آسان نیست. بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به مهارت‌های زبانی و ارتباطی دارند اجتناب کنید. احتمالا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 25 < score <= 34:
        return first_sentence + " که نمره قابل قبولی می‌باشد. این بدین معناست که سخنرانی، معنا شناسی و دستور زبان و کاربرد لغات برای شما چندان مشکل نیست ، بنابراین شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. در صورت ورود به مشاغلی که نیاز زیادی به این ویژگی‌ها دارند به شما توصیه می‌گردد حتما برای تقویت این توانمندی‌ها برنامه ریزی لازم را داشته باشید."
    elif 34 < score <= 42:
        return first_sentence + " که نمره بالایی می‌باشد. این نمره بیانگر آن است که هوش زبانی - کلامی‌جزو ویژگی‌های مثبت شما می‌باشد و این بدین معناست که سخنرانی، معنا شناسی، استفاده از دستور زبان و کاربرد لغات برای شما آسان است. شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."
    elif 42 < score <= 50:
        return first_sentence + " که نمره بسیار بالایی است. این نمره بیانگر آن است که هوش زبانی - کلامی‌جزو ویژگی‌های برجسته شما می‌باشد و این بدین معناست که سخنرانی، معنا شناسی، استفاده از دستور زبان و کاربرد لغات برای شما آسان است. شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. "


def gardner_logical_explain(score):
    first_sentence = "نمره کسب شده توسط شما در این مقیاس " + str(round(score / 50 * 100)) + " می‌باشد،"
    if 10 <= score <= 17:
        return first_sentence + " که نمره بسیار کمی‌است. این نمره بیانگر این است که احتمالا هوش منطقی - ریاضی جزو ویژگی‌های برجسته شما نمی‌باشد. این بدین معناست که ارتباط با اعداد و ارقام برای شما دشوار است و کشف منطق موجود در رشته اعداد یا تحلیل الگو‌ها و انجام محاسبات و درک منطق روابط برای شما چندان آسان نیست. بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به تحلیل و تفسیر ارقام و پیدا کردن الگوها دارند اجتناب کنید. زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 17 < score <= 25:
        return first_sentence + " که نمره کمی‌است.این نمره بیانگر این است که احتمالا هوش منطقی - ریاضی جزو ویژگی‌های برجسته شما نمی‌باشد. این بدین معناست که ارتباط با اعداد و ارقام برای شما دشوار است و کشف منطق موجود در رشته اعداد یا تحلیل الگو‌ها و انجام محاسبات و درک منطق روابط برای شما چندان آسان نیست. بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به تحلیل و تفسیر ارقام و پیدا کردن الگوها دارند اجتناب کنید. زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 25 < score <= 34:
        return first_sentence + " که نمره قابل قبولی می‌باشد. این بدین معناست که ارتباط با اعداد و ارقام و کشف منطق موجود در رشته اعداد یا تحلیل الگو‌ها و انجام محاسبات و درک منطق روابط برای شما چندان مشکل نیست، بنابراین شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در حوزه فعالیت خود قراردهید. احتمالا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. در صورت ورود به مشاغلی که نیاز زیادی به این ویژگی‌ها دارند به شما توصیه می‌گردد حتما برای تقویت این استعداد برنامه ریزی لازم را داشته باشید."
    elif 34 < score <= 42:
        return first_sentence + " که نمره بالایی می‌باشد. این نمره بیانگر آن است که هوش منطقی - ریاضی جزو ویژگی‌های مثبت شما می‌باشد، این بدین معناست که ارتباط با اعداد و ارقام برای شما آسان است، و همچنین کشف المنطق موجود در رشته اعداد یا تحلیل الگوها و انجام محاسبات و درک منطق روابط برای شما جذاب است. شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد."
    elif 42 < score <= 50:
        return first_sentence + " که نمره بسیار بالایی می‌باشد. این نمره بیانگر آن است که هوش منطقی - ریاضی جزو ویژگی‌های برجسته شما می‌باشد، این بدین معناست که ارتباط با اعداد و ارقام برای شما آسان است و کشف منطق موجود در رشته اعداد یا تحلیل الگوها و انجام محاسبات و درک منطق روابط برای شما جذاب است. شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."


def gardner_body_explain(score):
    first_sentence = "نمره کسب شده توسط شما در این مقیاس " + str(round(score / 50 * 100)) + " می‌باشد،"
    if 10 <= score <= 17:
        return first_sentence + " که نمره بسیار کمی‌است. این نمره بیانگر این است که احتمالا هوش جسمی‌- حرکتی جزو ویژگی‌های برجسته شما نمی‌باشد. این بدین معناست که ارتباط عصب - عضله برای شما دشوار است و انجام حرکات بدنی و فعالیت‌های فیزیکی دقیق برای شما دشوار می‌باشد. بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به فعالیت‌های جسمی‌و حرکتی زیاد و با دقت بالا دارند اجتناب کنید، زیرافعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 17 < score <= 25:
        return first_sentence + " که نمره کمی‌است. این نمره بیانگر این است که احتمالا هوش جسمی‌- حرکتی جزو ویژگی‌های برجسته شما نمی‌باشد. این بدین معناست که ارتباط عصب - عضله برای شما دشوار است و انجام حرکات بدنی و فعالیت‌های فیزیکی دقیق برای شما دشوار می‌باشد. بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به فعالیت‌های جسمی‌و حرکتی زیاد و با دقت بالا دارند اجتناب کنید، زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد. "
    elif 25 < score <= 34:
        return first_sentence + " که نمره قابل قبولی می‌باشد. این بدین معناست که ارتباط عصب - عضله برای شما چندان دشوار نیست و انجام حرکات بدنی و فعالیت‌های فیزیکی دقیق گاهی میتواند برایتان جذاب باشد، بنابراین شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. در صورت ورود به مشاغلی که نیاز زیادی به این ویژگی دارند به شما توصیه می‌گردد حتما برای تقویت این استعداد برنامه ریزی لازم را داشته باشید."
    elif 34 < score <= 42:
        return first_sentence + " که نمره بالایی می‌باشد. این نمره بیانگر آن است که هوش جسمی‌- حرکتی جزو ویژگی‌های مثبت شما می‌باشد، این بدین معناست که ارتباط عصب - عضله برای شما آسان است و همچنین انجام حرکات بدنی و فعالیت‌های فیزیکی دقیق برای شما جذاب می‌باشد. شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد."
    elif 42 < score <= 50:
        return first_sentence + " که نمره بسیار بالایی می‌باشد. این نمره بیانگر آن است که هوش جسمی‌- حرکتی جزو ویژگی‌های برجسته شما می‌باشد، این بدین معناست که ارتباط عصب - عضله برای شما آسان است و همچنین انجام حرکات بدنی و فعالیت‌های فیزیکی دقیق برای شما جذاب می‌باشد. شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد."


def gardner_musical_explain(score):
    first_sentence = "نمره کسب شده توسط شما در این مقیاس " + str(round(score / 50 * 100)) + " می‌باشد،"
    if 10 <= score <= 17:
        return first_sentence + " که نمره بسیار کمی‌است. این نمره بیانگر این است که احتمالا هوش موسیقایی جزو توانمندی‌های شما محسوب نمی‌گردد. این بدین معناست که تشخیص ریتم و نت‌های موسیقی برای شما چندان آسان نیست و توانایی کشف الگوهای موسیقی برای شما دشوار می‌باشد، بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به کشف الگوهای موسیقیایی زیادی دارند اجتناب کنید. زیرا این موضوع باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 17 < score <= 25:
        return first_sentence + " که نمره کمی‌است. این نمره بیانگر این است که احتمالا هوش موسیقایی جزو توانمندی‌های شما محسوب نمی‌گردد. این بدین معناست که تشخیص ریتم و نت‌های موسیقی برای شما چندان آسان نیست و توانایی کشف الگوهای موسیقی برای شما دشوار می‌باشد، بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به کشف الگوهای موسیقیایی زیادی دارند اجتناب کنید. زیرا این موضوع باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 25 < score <= 34:
        return first_sentence + " که نمره قابل قبولی می‌باشد. این بدین معناست که تشخیص ریتم و نت‌های موسیقی برای شما چندان دشوار نیست و توانایی کشف الگوهای موسیقی برای شما میسر می‌باشد ، بنابراین شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. در صورت ورود به مشاغلی که نیاز زیادی به این ویژگی دارند به شما توصیه می‌گردد حتما برای تقویت این استعداد برنامه ریزی لازم را داشته باشید."
    elif 34 < score <= 42:
        return first_sentence + " که نمره بالایی می‌باشد. این نمره بیانگر آن است که هوش موسیقایی جزو ویژگی‌های مثبت شما می‌باشد، این بدین معناست که تشخیص ریتم و نت‌های موسیقی برای شما آسان است و توانایی کشف الگوهای موسیقی را دارا می‌باشید. شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد."
    elif 42 < score <= 50:
        return first_sentence + " که نمره بسیار بالایی می‌باشد. این نمره بیانگر آن است که هوش موسیقایی جزو ویژگی‌های برجسته شما می‌باشد، این بدین معناست که تشخیص ریتم و نت‌های موسیقی برای شما آسان است و توانایی کشف الگوهای موسیقی را دارا می‌باشید. شما میتوانید  تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد."


def gardner_intrapersonal_explain(score):
    first_sentence = "نمره کسب شده توسط شما در این مقیاس " + str(round(score / 50 * 100)) + " می‌باشد،"
    if 10 <= score <= 17:
        return first_sentence + " که نمره بسیار کمی‌است. این نمره بیانگر این است که احتمالا هوش بین فردی جزو توانمندی‌های شما محسوب نمی‌گردد. این بدین معناست که ارتباطات انسانی و تعامل گسترده با افراد دیگر برای شما دشوار است و توانایی کشف و فهم حالات و هیجانات افراد و همچنین همدلی و همدردی با دیگران برای شما دشوار می‌باشد. بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به ارتباطات انسانی گسترده دارند و لازم است با دیگران همدردی و همدلی داشته باشید، اجتناب کنید. زیرا این موضوع باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل نگردد."
    elif 17 < score <= 25:
        return first_sentence + " که نمره کمی‌است. این نمره بیانگر این است که احتمالا هوش بین فردی جزو توانمندی‌های شما محسوب نمی‌گردد. این بدین معناست که ارتباطات انسانی و تعامل گسترده با افراد دیگر برای شما دشوار است و توانایی کشف و فهم حالات و هیجانات افراد و همچنین همدلی و همدردی با دیگران برای شما دشوار می‌باشد. بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به ارتباطات انسانی گسترده دارند و لازم است با دیگران همدردی و همدلی داشته باشید، اجتناب کنید. زیرا این موضوع باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل نگردد."
    elif 25 < score <= 34:
        return first_sentence + " که نمره قابل قبولی می‌باشد. این بدین معناست که ارتباطات انسانی و تعامل گسترده با انسان‌ها برای شما چندان دشوار نیست و توانایی کشف و فهم حالات انسان‌ها و هیجانات آنها و همدلی و همدردی با افراد برای شما میسر می‌باشد، بنابراین شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید. زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. در صورت ورود به مشاغلی که نیاز زیادی به این ویژگی دارند به شما توصیه می‌گردد حتما برای تقویت این استعداد برنامه ریزی لازم را داشته باشید."
    elif 34 < score <= 42:
        return first_sentence + " که نمره بالایی می‌باشد.  این نمره بیانگر آن است که هوش بین فردی جزو ویژگی‌های مثبت شما می‌باشد ، این بدین معناست که ارتباطات انسانی و تعامل گسترده با انسان‌ها برای شماآسان است و توانایی کشف و فهم حالات انسان‌ها و هیجانات آنها و تجربه کردن تجارب آن‌ها و همدلی و همدردی با آن‌ها  برای شما میسر می‌باشد . شما میتوانید  تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."
    elif 42 < score <= 50:
        return first_sentence + " که نمره بسیار بالایی می‌باشد.  این نمره بیانگر آن است که هوش بین فردی جزو ویژگی‌های برجسته شما می‌باشد ، این بدین معناست که ارتباطات انسانی و تعامل گسترده با انسان‌ها برای شماآسان است و توانایی کشف و فهم حالات انسان‌ها و هیجانات آنها و تجربه کردن تجارب آن‌ها و همدلی و همدردی با آن‌ها  برای شما میسر می‌باشد . شما میتوانید  تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."


def gardner_interpersonal_explain(score):
    first_sentence = "نمره کسب شده توسط شما در این مقیاس " + str(round(score / 50 * 100)) + " می‌باشد،"
    if 10 <= score <= 17:
        return first_sentence + " که نمره بسیار کمی‌است. این نمره بیانگر این است که احتمالا هوش درون فردی جزو توانمندی‌های شما محسوب نمی‌گردد. این بدین معناست که ارزیابی درونی و خلوت کردن با خود برای شما دشوار است و توانایی‌های شما در خوشناسی، آگاهی درونی از نقاط ضعف و قوت و انگیزه‌های درونی برای شما سخت است ، بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به درون نگری گسترده دارند و لازم است با دیگران همدردی و همدلی کنید اجتناب کنید زیرا این موضوع باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 17 < score <= 25:
        return first_sentence + " که نمره کمی است. این نمره بیانگر این است که احتمالا هوش درون فردی جزو توانمندی‌های شاخص شما محسوب نمی‌گردد. این بدین معناست که ارزیابی درونی و خلوت کردن با خود برای شما دشوار است و توانایی‌های شما در خوشناسی، آگاهی درونی از نقاط ضعف و قوت و انگیزه‌های درونی برای شما سخت است ، بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به درون نگری گسترده دارند و لازم است با دیگران همدردی و همدلی کنید اجتناب کنید زیرا این موضوع باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 25 < score <= 34:
        return first_sentence + " که نمره قابل قبولی می‌باشد.   این بدین معناست که ارزیابی درونی و خلوت کردن با خود برای شما چندان دشوار نیست و توانایی‌های شما در خوشناسی در حد قابل قبولی است و آگاهی درونی از نقاط ضعف و قوت و انگیزه‌های درونی برای شما میسر است، بنابراین شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. در صورت ورود به مشاغلی که نیاز زیادی به این ویژگی دارند به شما توصیه می‌گردد حتما برای تقویت این استعداد برنامه ریزی لازم را داشته باشید."
    elif 34 < score <= 42:
        return first_sentence + " که نمره بالایی می‌باشد.  این نمره بیانگر آن است که هوش درون فردی جزو ویژگی‌های مثبت شما می‌باشد ، این بدین معناست که ارزیابی درونی و خلوت کردن با خود برای شما آسان است و توانایی‌های شما در خوشناسی خوب است و آگاهی درونی از نقاط ضعف و قوت و انگیزه‌های درونی برای شما میسر است . شما میتوانید  تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد. "
    elif 42 < score <= 50:
        return first_sentence + " که نمره بسیار بالایی می‌باشد.  این نمره بیانگر آن است که هوش درون فردی جزو ویژگی‌های مثبت شما می‌باشد ، این بدین معناست که ارزیابی درونی و خلوت کردن با خود برای شما آسان است و توانایی‌های شما در خوشناسی خوب است و آگاهی درونی از نقاط ضعف و قوت و انگیزه‌های درونی برای شما به راحتی میسر است . شما میتوانید  تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."


def gardner_naturalistic_explain(score):
    first_sentence = "نمره کسب شده توسط شما در این مقیاس " + str(round(score / 50 * 100)) + " می‌باشد،"
    if 10 <= score <= 17:
        return first_sentence + " که نمره بسیار کمی‌است. این نمره بیانگر این است که احتمالا هوش طبیعت گرا جزو توانمندی‌های شما محسوب نمی‌گردد. این بدین معناست که محیط زیست و جانداران و تعامل با آن‌ها برای شما جذاب نیست  و ارتباط با طبعیت و جانداران برای شما دشوار می‌باشد ، بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به تعامل گسترده با طبعیت دارند اجتناب کنید زیرا این موضوع باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 17 < score <= 25:
        return first_sentence + " که نمره کمی‌است. این نمره بیانگر این است که احتمالا هوش طبیعت گرا جزو توانمندی‌های شما محسوب نمی‌گردد. این بدین معناست که محیط زیست و جانداران و تعامل با آن‌ها برای شما چندان جذاب نیست  و ارتباط با طبعیت و جانداران برای شما نسبتا دشوار می‌باشد ، بنابراین به شما توصیه می‌شود از تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به تعامل گسترده با طبعیت دارند اجتناب کنید زیرا این موضوع باعث می‌شود نتیجه مناسب و دلخواه در این حوزه برای شما حاصل نگردد."
    elif 25 < score <= 34:
        return first_sentence + " که نمره قابل قبولی می‌باشد.   این بدین معناست که محیط زیست و جانداران و تعامل با آن‌ها برای شما چندان جذاب نسبتا جذاب است  و ارتباط با طبعیت و جانداران برای شما چندان دشوار نیست، بنابراین شما میتوانید تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید زیرا فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه برای شما حاصل گردد. در صورت ورود به مشاغلی که نیاز زیادی به این ویژگی دارند به شما توصیه می‌گردد حتما برای تقویت این استعداد برنامه ریزی لازم را داشته باشید."
    elif 34 < score <= 42:
        return first_sentence + " که نمره بالایی می‌باشد.  این نمره بیانگر آن است که هوش طبیعت گرا جزو ویژگی‌های مثبت شما می‌باشد ، این بدین معناست که محیط زیست و جانداران و تعامل با آن‌ها برای شما جذاب است و ارتباط با طبعیت و جانداران برای شما لذت بخش می‌باشد  . شما میتوانید  تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."
    elif 42 < score <= 50:
        return first_sentence + " که نمره بسیار بالایی می‌باشد.  این نمره بیانگر آن است که هوش طبیعت گرا جزو ویژگی‌های برجسته شما می‌باشد ، این بدین معناست که محیط زیست و جانداران و تعامل با آن‌ها برای شما  بسیار جذاب است و ارتباط با طبعیت و جانداران برای شما لذت بخش می‌باشد  . شما میتوانید  تحصیل در رشته‌ها و یا اشتغال به کار در شغل‌هایی که نیاز به این مهارت‌ها و استعدادها دارند را در مسیر خود قراردهید ، فعالیت در این حوزه باعث می‌شود نتیجه مناسب و دلخواه  برای شما حاصل گردد."


# The Neo quiz info needed
def neo_extraversion_explain(score):
    if 0 <= score <= 14:
        return 'نمره شما بیانگر این است شما انسان درونگرایی هستید و به طور معمول تنهایی و خلوت خود را ترجیح می‌دهید. به نظر می‌رسد شکل دادن روابط اجتماعی برای شما دشوار است و به همین دلیل ترجیح می‌دهید دوستان معدود و مشخصی داشته باشید. همچنین به نظر می‌رسد تعاملات اجتماعی و حضور در جمع‌های متنوع برای شما کار سختی است و انرژی زیادی از شما می‌گیرد و بعد از مدت زمانی ترجیح می‌دهید جمع را ترک کرده و ساعاتی را به تنهایی سپری کنید. به نظر می‌رسد صحبت کردن در جمع، یا صحبت کردن درباره مشکلات و مسائلی که ذهن شما را درگیر کرده است برای شما کار انرژی بری است. با این توضیحات به شما توصیه می‌گردد از تحصیل در رشته‌ها و اشتغال به مشاغلی که نیاز به روابط گسترده اجتماعی و بین فردی دارند، اجتناب کنید زیرا ممکن است برای شما نارضایتی شغلی و تحصیلی ایجاد کند.', 'درونگرایی'
    elif 15 <= score <= 33:
        return 'نمره شما بیان گر این است که شما انسان میان گرایی هستید، یعنی به میزان تقریبا برابری برونگرایی و درونگرایی در شما وجود دارد. این به این معناست که شما احتمالا می‌توانید با طیف گسترده ای از افراد ارتباط برقرار کنید اما در عین حال تنهایی نیز شما را آزار نمی‌دهد. بودن در جمع برای شما کار دشواری نیست و شما می‌توانید برای ساعات متمادی در جمع حضور داشته باشید و در عین حال اگر تنها باشید نیز اذیت نمی‌شوید. صحبت کردن در جمع برای شما دشوار نباشد و در عین حال می‌توانید با مشکلات خود به تنهایی رو به رو شوید و یا از دیگران برای حل آن‌ها کمک بگیرید. این توضیحات به این معناست که برونگرایی و درونگرایی برای شما محدودیتی ایجاد نمی‌کند و در مشاغل مختلف و رشته‌های متنوعی می‌توانید اشتغال ویا تحصیل داشته باشید. به شما پیشنهاد می‌شود برای سلامت بیشتر خود هر دو این حوزه‌ها را در نظر داشته باشید تا بتوانید بهزیستی بیشتری داشته باشید.', 'میان گرایی'
    elif 34 <= score <= 48:
        return 'نمره شما بیانگر این است شما انسان برونگرایی هستید و به طور معمول حضور در جمع و سپری کردن وقتتان را با دیگران ترجیح می‌دهید. به نظر می‌رسد شکل دادن روابط اجتماعی برای شما آسان است و به همین دلیل ترجیح می‌دهید دوستان زیادی داشته باشید. همچنین به نظر می‌رسد تعاملات اجتماعی و حضور در جمع‌های متنوع برای شما کار لذت بخش است و انرژی زیادی از شما نمی‌گیرد . به نظر می‌رسد صحبت کردن در جمع، یا صحبت کردن درباره مشکلات و مسائلی که ذهن شما را درگیر کرده است برای شما کاری ساده است. با این توضیحات به شما توصیه می‌گردد تحصیل در رشته‌ها و اشتغال به مشاغلی که نیاز به روابط گسترده اجتماعی و بین فردی دارند، را مد نظر قرار دهید زیرا برای شما رضایت شغلی و تحصیلی ایجاد میکند.', 'برونگرایی'
    else:
        return None, None


def neo_agreeableness_explain(score):
    if 0 <= score <= 14:
        return 'نمره شما نشان دهنده این است که فردی خود محور هستید. این نمره بدین معناست که شما فردی هستید که از رقابت لذت می‌برید و گاهی در فعالیت‌های تیمی‌عملکرد خوبی از خود نشان نمیدهید و رفتار مجادله گرایانه از خود نشان میدهید . شما مواضع خود را تعیین میکنید و بر ایستادن بر آن‌ها اصرار دارید و از مواضع خود عقب نشینی نمی‌کنید، این موضوع باعث می‌شود بتوانید به راحتی از حقوق خود و اطرافیانتان محافظت کنید. برای شما داشتن ارتباط با طیف وسیعی از اشخاص دشوار است. همچنین اولویت اول، خودتان هستید و خواسته‌ها و انتظارات دیگران برای شما اولویت پایینی دارند و گاهی دیگران شما را فردی خودخواه و غیر اجتماعی می‌دانند.  به شما توصیه می‌گردد از تحصیل و اشتغال به مشاغلی که نیاز به انعطاف پذیری بالا دارند اجتناب کنید، زیرا این رشته‌ها و مشاغل میتوانند برای شما دشوار و ناراضی کننده باشند.', 'خود محور'
    elif 15 <= score <= 33:
        return 'نمره شما نشان دهنده این است که فردی میان گرا هستید. این نمره بدین معناست که شما فردی هستید که گاهی از رقابت لذت می‌برید. شما در فعالیت‌های تیمی‌عملکرد خوبی از خود نشان دهید و میتوانید با گستره وسیعی از افراد ارتباط برقرار کنید. مواضع خود را تعیین میکنید و بر ایستادن بر آن‌ها اصرار دارید اما اگر بتوان شما را درباره موضوعی قانع کرد نیز از مواضع خود عقب نشینی می‌کنید. در برخی موارد برای شما اولویت اول، خودتان نیستید و خواسته‌ها و انتظارات دیگران برای شما اولویت دارند. به شما توصیه می‌گردد در تحصیل و اشتغال به مشاغلی که نیاز به قاطعیت بالا دارند با احتیاط وارد شوید. این مشاغل ممکن است برای شما مشاغل دشوار و ناراضی کننده ای باشند.', 'میان گرا'
    elif 34 <= score <= 48:
        return 'نمره شما نشان دهنده این است که فرد سازش گر و توافق جویی هستید. این نمره بدین معناست که شما فردی هستید که ترجیح می‌دهید بجای رقابت کردن با دیگران بیشتر به آن‌ها کمک کنید. شما فردی هستید که می‌توانید در فعالیت‌های تیمی‌عملکرد خوبی از خود نشان دهید و با گستره وسیعی از افراد ارتباط برقرار کنید. شما مواضع خود را تعیین میکنید اما بر ایستادن بر ان‌ها اصراری ندارید و از مواضع خود عقب نشینی می‌کنید و بسته به شرایط با افراد مختلف ممکن است حتی بدون مذاکره هم انعظاف به خرج  دهید. این موضوع باعث می‌شود در برخی از موارد نتوانید از حقوق خود و اطرافیان خود پاسداری کنید و ممکن است اجازه پایمال شدن حقوق خود را ناخواسته بدهید. برای شما اولویت اول، خودتان نیستید بلکه خواسته‌ها و انتظارات دیگران برای شما اولویت دارند و به راحتی از انتظارات خود برای دیگران عقب نشینی می‌کنید. دیگران شما را فرد خوش مشرب و اجتماعی می‌دانند و روابط اجتماعی قابل قبولی دارید. با این توصیفات به شما توصیه می‌گردد از تحصیل و اشتغال به مشاغلی که نیاز به قاطعیت بالا دارند اجتناب کنید. این مشاغل ممکن است برای شما مشاغل دشوار و ناراضی کننده ای باشند.', 'سازش گرا'
    else:
        return None, None


def neo_neuroticism_explain(score):
    if 0 <= score <= 14:
        return 'نمره شما نشان دهنده این است که شما فردی هستید که به لحاظ هیجانی و عاطفی توسط محیط تحریک نمی‌شوید و تجربه هیجانی به سختی و به ندرت در شما به وجود می‌آید. به نظر می‌رسد شما ترجیح می‌دهید پدیده‌های محیط اطراف خود را با نگاهی عقلانی و غیر احساسی بررسی کنید، این موضوع باعث می‌شود شما نوسانات گسترده خلقی را تجربه نکنید. در شما مشکلات جسمی‌و روانشناختی کمتری دیده می‌شود. معمولا آرام هستید و احساسات منفی مثل غم، افسردگی، استرس و نگرانی کمتر در شما دیده می‌شود. به شما توصیه می‌گردد که در انتخاب رشته و شغل، فعالیت در حوزه‌هایی که در محیط‌های پر تنش هستند را مد نظر قرار دهید، زیرا برای شما بودن در این محیط‌ها دشوار نیست و این ویژگی میتواند مزیت بسیار خوبی برای شما باشد. اما بهتر است در نظر داشته باشید که این انکار هیجانی در بلند مدت می‌تواند باعث به وجود آمدن مشکلات متنوعی در روابط و حتی مشکلات جسمی‌شود.', 'انکار هیجانی'
    elif 15 <= score <= 33:
        return 'نمره شما نشان دهنده این است که شما فردی هستید که به لحاظ هیجانی و عاطفی کمتر توسط محیط تحریک می‌شوید. به نظر می‌رسد شما ترجیح می‌دهید پدیده‌های محیط اطراف خود را با نگاهی مثبت بررسی کنید، این موضوع باعث می‌شود شما به صورت سازنده نوسانات خلقی را تجربه کنید. در شما مشکلات جسمی‌و روانشناختی کمتری دیده می‌شود. معمولا آرام هستید و احساسات منفی مثل غم، افسردگی، استرس و نگرانی چندان در شما دیده می‌شود اما نه به شکل آزار دهنده. به شما توصیه می‌گردد که در انتخاب رشته و شغل، فعالیت در حوزه‌هایی که در محیط‌های پر تنش هستند را مد نظر قرار دهید، زیرا برای شما بودن در این محیط‌ها دشوار نیست و این ویژگی میتواند مزیت بسیار خوبی برای شما باشد.', 'ثبات هیجانی'
    elif 34 <= score <= 48:
        return 'نمره شما نشان دهنده این است که شما فردی هستید که توسط محیط به لحاظ هیجانی و عاطی بسیار تحریک می‌شوید. به نظر می‌رسد شما ترجیح می‌دهید پدیده‌های محیط اطراف خود را با نگاه منفی برداشت می‌کنید و احساس تهدید و استرس و فشار می‌کنید. این موضوع باعث می‌شود به طور مداوم در حالت گوش به زنگ هستید و این باعث می‌شود بخش زیادی از انرژی خود را صرف بررسی محیط اطراف می‌کنید. شما نوسانات گسترده خلقی را تربه می‌کنید. این نوسانات الزاما ب معنای این نیستند که مداوم د حالت اضطرابی باشید بلکه ممکن است شکل‌های مختلفی مانند افسردگی یا خشم و .. داشته باشد. به شما توصیه می‌گردددر انتخاب رشته و مشاغل، از ادامه فعالیت در مشاغلی که در محیط‌های پر تنش هستند، جتناب کنید. این محیط‌ها ی توانند طیف کسترده ای داشته باشند، از رشته‌هایی ماند حقوق تا پزشکی. زیرا بودن در ای محیط‌ها فشار روانی را در شما به طور چش گیری افزایش می‌دهد', 'روان رنجور'
    else:
        return None, None


def neo_openness_explain(score):
    if 0 <= score <= 14:
        return 'وضعیت شما حاکی از این است که شما فرد محافظه کاری هستید وترجیح می‌دهید از آدب و رسوم پیروی کنید. شما ترجیح می‌دهید در محیط‌هایی که می‌شناسید حضور داشته باشید و تمایل  به تجربه رویدادی که شناختی از آن ندارید را در خود حس نمیکنید. همچنین ممکن است شما فردی مستقل به نظر برسید زیرا خود را در موقعیت‌هایی که نیاز به تصمیمات جدید درند قرار نمی‌دهید و این باعث می‌شود بتوانید در انجام کارهای خود از الگو‌ها و روش‌هایی که درست هستند و درستی آن‌ها مشخص شده است استفاده کنید که باعث می‌شود در انجام کارهای خود موفق به نظر برسید. به شما توصیه می‌شود از تحصیل در رشته‌ها یا اشتغال به مشاغلی که نیاز به تجربه جدید یا خلاقیت دارند اجتناب کنید زیرا بودن در این محیط‌ها باعث می‌شود احساس ناکارامدی کنید.  ', 'محافظه کار'
    elif 15 <= score <= 33:
        return 'وضعیت شما حاکی از این است که شما فردی میان گرا در برابر تجربه هستید. شما گاهی در برابر تجربه‌های جدید، فردی با ذهن باز و پذیرا، دارای تخیل و خلاقیت می‌باشید و گاهی به سنت‌ها و باورهای خود پناه برده و بر ان‌ها تکیه می‌کنید.گاهی ترجیح میدهید در محیط‌هایی که می‌شناسید حضور داشته باشید و تمایل به تجربه رویدادی که شناختی از آن ندارید را در خود حس نمیکنید. شما فردی هستید که نسبت به تجربه کردن رویدادهای جهان اطراف خود معمولا اشتیاق دارید. شما گاهی طالب لذت بردن از نظریه‌های جدید هستید و در مقایسه با افراد محافظه کار، احساسات مثبت و منفی بیشتری تجربه میکنید. به شما توصیه می‌شود برای تحصیل در رشته‌ها یا اشتغال به مشاغلی که نیاز به تجربه‌های جدید زیاد و یا خلاقیت بسیار دارند و یا مشاغلی که به صورت گسترده بر باورهای ثابت و غیر قابل تاکید دارند با احتیاط تصمیم گیری کنید، زیرا بودن در این محیط‌ها ممکن است باعث شود احساس ناکارآمدی کنید.', 'میانه گرا'
    elif 34 <= score <= 48:
        return 'وضعیت شما حاکی از این است که شما فردی گشوده در برابر تجربه هستید. شما در برابر تجربه‌های جدید، فردی با ذهن باز و پذیرا، دارای تخیل و خلاقیت می‌باشید. شما فردی هستید که نسبت به تجربه کردن رویدادهای جهان اطراف خود اشتیاق دارید.شما زندگی سرشار از تجربه را دوست دارید و درباره تجارب درونی و دنیای پیرامون کنجکاو می‌باشید. شما طالب لذت بردن از نظریه‌های جدید و ارزش‌های غیرمتعارف هستید و در مقایسه با افراد محافظه کار، احساسات مثبت و منفی فراوانی تجربه میکنید.. شما ممکن است با طرز تفکر رایج جامعه مخالف بوده و از نظر اخلاقی، اجتماعی و سیاسی دیدگاه‌های متنوعی داشته باشید. به شما توصیه می‌شود از تحصیل در رشته‌ها یا اشتغال به مشاغلی که نیاز به تجربه جدید یا خلاقیت دارند استقبال کنید زیرا بودن در این محیط‌ها باعث می‌شود احساس کارآمدی کنید.', 'گشوده به تجربه'
    else:
        return None, None


def neo_conscientiousness_explain(score):
    if 0 <= score <= 14:
        return 'نتایج آزمون شما نشان می‌دهد که شما فردی تنوع طلب هستید. شما در شرایط غیر قابل پیش بینی، سازگاری بیشتری از خود نشان می‌دهید و انعطاف پذیر می‌باشید. جاه طلب نیستید و معیارهای سفت و سختی برای خود تعیین نمی‌کنید، به همین دلیل برای رسیدن به این معیارها، خود را تحت فشار قرار نمی‌دهید. در موقعیت‌های اضطراری می‌تواند به سرعت تصمیم گیری کنید. همچنین به دلیل انعطاف پذیر بودن، برای مشاغلی که چارچوب مشخصی ندارند مناسب می‌باشید. شما گاهی در کنترل خود با دشواری مواجه میشوید.  رفتارهایتان گاها غیر هدفمند است. شما در برخی موارد بی نظم هستید. به رفتارهای تکانشی گرایش دارید؛ یعنی گاهی به عواقب تصمیمات تان و مزایا و معایب آن فکر نمی‌کنید و بدون فکر، سریعاً دست به عمل می‌زنید. کمتر هدف مند هستید . انگیزه و پشتکار زیادی ندارید و کمتر می‌توانند در مسیر اهداف بلند مدت، با پشتکار مسیر خود را ادامه دهید. به موقع انجام دادن کارها برایتان، اهمیت چندانی ندارد. معمولا دیر سرِ کار یا سر کلاس می‌رسید یا قرار‌های مهم را از دست می‌دهید. یعنی ممکن است خوش قول و با برنامه نباشید. به شما توصیه می‌گردد در انتخاب شغل و رشته تحصیلی،  فعالیت و تحصیل در رشته‌هایی که با شرایط غیر قابل پیش بینی مواجه می‌شوند را مد نظر قرار دهید زیرا نداشتن برنامه از پیش تعیین شده و لزوم تصمیم گیری ناگهانی می‌تواندبرای شما نسبت به دیگران امتیاز قابل توجهی محسوب شود.', 'تنوع طلب'
    elif 15 <= score <= 33:
        return 'نتایج آزمون شما نشان می‌دهد که شما فردی میان گرا در مسئولیت پذیری و داشتن انظباط هستید. شما معمولا بر باورها و ارزش‌های خود تاکید دارید و تلاش میکنید تا به صورت منظم و از پیش تعیین شده برنامه‌های خود را پیش ببرید و از تصمیمیات هیجانی و ناگهانی اجتناب کنید. شما در  کنترل خود توانایی قابل قبولی دارید و رفتارهایتان هدفمند است. شما معمولا نسبت به دیگران، احساس مسئولیت می‌کنید، از خانواده و دوستان گرفته تا همکاران و حتی غریبه‌ها. با وجود این ویژگی‌ها، می‌توانید درمواقعی انعطاف پذیر نیز باشید و همین باعث می‌شود بتواند با شرایط پیش بینی نشده هم تا حدی سازگار شوید. بنابراین قادر هستید در چنین شرایطی، سریع تصمیم گیری کنید. معمولا شما به پیشرفت، علاقه زیادی دارید و  در زمینه تحصیلی و شغلی به موفقیت‌هایی دست می‌یابید. شما سعی می‌کنید با رفتار و گفتار خود، دیگران را آزرده نکنید. به شما توصیه می‌گردد در انتخاب شغل و رشته تحصیلی،  برای فعالیت در زمینه‌هایی که با شرایط غیر قابل پیش بینی مواجه می‌شوند محتاط باشید زیرا نداشتن برنامه از پیش تعیین شده و لزوم تصمیم گیری ناگهانی می‌تواند رضایت شما  از رشته و شغل را کاهش دهد.', 'میان گرا'
    elif 34 <= score <= 48:
        return 'نتایج آزمون شما نشان می‌دهد که شما فرد مسئولیت پذیر، منظم و منضبط هستید. شما بر باورها و ارزش‌های خود تاکید بسیار دارید، تلاش میکنید تا به صورت منظم و از پیش تعیین شده برنامه‌های خود را پیش ببرید و از تصمیمیات هیجانی و ناگهانی اجتناب می‌کنید. شما به وقت شناسی و نظم در کارها شهرت دارید و برای جزیئات ارزش قائل هستید. شما می‌توانید خود را کنترل کنید و رفتارهایتان هدفمند است. این ویژگی باعث می‌شود که شما انعظاف پذیر نباشید و وقتی تصمیمی‌گرفته می‌شود و مقدمات آن فراهم می‌شود حتما باید به وقوع بپیوندد. همچنین شما می‌توانید با بیش از اندازه کار کردن به خود و روابط خود آسیب بزنید. باور شما به ارزش‌های خود می‌تواند متعصبانه و غیر قابل انعطاف باشد که این موضوع نیز می‌تواند بر کارایی و حضور شما در اجتماع نیز اثر گذار باشد. به شما توصیه می‌گردد در انتخاب شغل و رشته تحصیلی، از فعالیت و تحصیل در رشته‌هایی که با شرایط غیر قابل پیش بینی مواجه می‌شوند اجتناب کنید زیرا نداشتن برنامه از پیش تعیین شده و لزوم تصمیم گیری ناگهانی می‌تواند رضایت شما  از رشته و شغل را کاهش دهد.', 'مسئولیت پذیر'
    else:
        return None, None


# The Holland quiz info needed

holland_color = {"Realistic": "ed242b", "Investigative": "2aa7dd", "Artistic": "039449", "Social": "814198",
                 "Enterprising": "f36e23", "Conventional": "fcb01c"}


def get_holland_score_color_name(score, name):
    if 0 <= score <= 12.5:
        return holland_color[name], 'پایین', 'کم'
    elif 12.5 < score <= 25:
        return holland_color[name], 'نسبتا پایین', 'متوسط'
    elif 25 < score <= 37.5:
        return holland_color[name], 'نسبتا بالا', 'متوسط'
    elif 37.5 < score <= 50:
        return holland_color[name], 'بالا', 'زیاد'
    else:
        return None, None, None


def get_holland_desire(name):
    if name == 'Realistic':
        return 'واقع گرا', 'به نظر می‌رسد شما مشاغل و رشته‌های واقع گرایانه را ترجیح می‌دهید که در آن‌ها نیازی به برقرای روابط اجتماعی به صورت گسترده نیست. برای حل مسائل و مشکلات از راه حل‌های واقع گرایانه استقبال می‌کنید و به صورت کلی اشیا و خصوصیات ملموس پدیده‌ها و اتفاقات را محترم شمرده و برای ان‌ها ارزش قائل هستید'
    elif name == 'Investigative':
        return 'جست و جو گر', 'به نظر می‌رسد شما رشته‌ها و مشاغلی را دوست دارید که مبتنی بر ایده‌ها و مفاهیم انتزاعی هستند. شما برای سوالات و مسائل پیچیده ارزش قائل هستید و حل سوالات پیچیده برای شما جذاب هستند. شما تحقیق کردن و فعالیت‌های علمی‌و پژوهشی را ترجیح می‌دهید، مخصوصا اگر فعالیت شما حول موضوعات انتزاعی باشد.'
    elif name == 'Artistic':
        return 'هنری', 'شما خود را فردی شهودی، با درون نگری بالا و صاحب صلاحیت در حوزه‌های هنری مانند موسیقی و عکاسی و نقاشی می‌دانید. پیروی کردن از نظم موجود برای شما می‌تواند دشوار باشد و ممکن است دیگران شما را ادم احساساتی بدانند. ترجیح می‌دهید در حوزه‌های هنری و زیبایی شناسانه فعالیت کنید.'
    elif name == 'Social':
        return 'اجتماعی', 'شما خود را فردی می‌دانید که برای فعالیت‌های اجتماعی و کارهای گروهی ارزش قائل هستید و از انجام کارهای مکانیکی اجتناب می‌کنید. شما برای مشاغل و رشته‌هایی ارزش قائل هستید که بر روابط اجتماعی تکیه دارند.'
    elif name == 'Enterprising':
        return 'کار آفرین', 'به نظر می‌رسد شما فردی با انرژی زیاد، مطمئن به خود و با اعتماد به نفس بالا باشید. شما برای رشته‌ها و مشاغلی ارزش قائلید که شما را به آرزوهای خود برسانند و باعث پیشرفت شما در زمینه‌های اقتصادی شوند. دیگران ممکن است شما را فردی جاه طلب و و پر هیجان توصیف کنند و بنابراین تحصیل در رشته‌هایی که سقف محدود و مشخص دارند شما را راضی نخواهد کرد.'
    elif name == 'Conventional':
        return 'قراردادی', 'فعالیت‌های قراردادی و با نظم و ثبات مشخص برای شما جذاب است و از خلاقیت و ابداع روش‌های حدید برای حل مسائل و مشکلات خود اجتناب می‌کنید و راه‌هایی که به صورت مرسوم وجود دارند را ترجیح می‌دهید. دیگران شما را فردی وظیفه شناس و محتاط می‌دانند و اشتغال در مشاغلی که ریسک زیاد و خلاقیت گسترده لازم دارند برای شما آزار دهنده است.'


def get_holland_work(name):
    if name == 'Realistic':
        return 'واقع گرا', 'می‌توان شما را فردی عمل گرا، صرفه جو، ثابت قدم و اغلب مادی گرا دانست. شما همچنین برای پول، قدرت و مقام ارزش قائل هستید. می‌توان گفت شما فردی هستید که به فعالیت‌های فنی علاقمند هستید و مشاغلی که مرتبط با این حیطه باشند را می‌پسندید. از کار کردن با دستگاه‌ها و همچنین ابزار ظریف لذت می‌برید. بیشتر اهل عمل کردن هستید تا اینکه بخواهید زمانتان را صرفاً صرف فکر کردن کنید. به طور کلی مسائلی را که عینی و واقعی باشند به مسائل مبهم ترجیح می‌دهید. شما کارهایی را ترجیح می‌دهید که نتایج عینی و ملموس به همراه داشته باشند. '
    elif name == 'Investigative':
        return 'جست و جو گر', 'شما برای تحلیل موضوعات اغلب کنجکاو بوده و با دیدی نقادانه به پدیده‌ها می‌نگرید. شما را می‌توان فردی مسئولیت پذیر و وظیفه گرا دانست، به گونه ای که اگر در شغل مورد علاقه تان مشغول باشید، در آن جذب شده و به خوبی از عهده فعالیت‌های مربوط به آن بر می‌آیید. می‌توان گفت که شما فردی هستید که جهت گیری علمی‌بالایی دارید. شما از جمع آوری اطلاعات، کشف نظریه‌های جدید و همچنین از تحلیل و تفسیر اطلاعات لذت برده و در محیط‌هایی که حالت آکادمیک و تحقیقی دارند احساس رضایت بیشتری را تجربه خواهید کرد. همچنین علاقمند هستید تا در تحصیل پیشرفت کرده و به مدارج بالاتر و پیشرفته تر دست پیدا کنید. شما بیشتر ترجیح می‌دهید به دنبال انجام وظایف و فعالیت‌های انتزاعی بروید و مشکلات و مسائل تان را نیز اغلب از طریق فکر کردن حل می‌کنید. به طور کلی مشاغلی مرتبط با اجرای تحقیقات و تحلیل‌ها و انجام کارهای آزمایشگاهی یا عملی و جمع آوری و سازمان بندی اطلاعات برای شما مناسب است. '
    elif name == 'Artistic':
        return 'هنری', 'شما فردی نسبتاً پیچیده و عاطفی هستید. شما به ویژه نسبت به طبیعت و حیوانات برخورد عاطفی تر و احساسی تری دارید. شما تمایل به فعالیت هنری حرفه ای دارید. در قضاوت‌ها و تصمیم‌هایتان به دریافت‌های شهودی خود اعتماد می‌کنید.  شما اغلب جذب فعالیت‌هایی می‌شوید که فرصت خود ابرازی را به شما بدهد. شما احتمالاً تمایل دارید تا برای مجلات، طرح‌های هنری طراحی کنید. به طور کلی محیط‌های مربوط به مشاغل و فعالیت‌های هنری مناسب شما می‌باشند. برای کار کردن، سازمانهایی به شما پیشنهاد میشود که قابل انعطاف و غیر سازمان یافته بوده و امکان خود ابرازی را برایتان فراهم کنند. '
    elif name == 'Social':
        return 'اجتماعی', 'دیگران اغلب شما را به عنوان فردی صمیمی‌و سرزنده می‌شناسند. شما معمولاً با مردم برخورد خوبی دارید. می‌توان گفت که شما فردی هستید که بیشتر تمایل دارید تا با مردم در ارتباط بوده و با آنها کار کنید. شما از کار کردن در گروه، تقسیم مسئولیت و مرکز توجه بودن، لذت می‌برید. شاخصه‌های شخصیتی و ترجیحات شما، سبب می‌شوند که از کار کردن با افراد، به ویژه از طریق رهبری، راهنمایی و تشویق کردن آنها، لذت ببرید. به طور کلی، شما از فعالیت‌ها و مشاغلی لذت می‌برید که مرتبط با آموزش دادن و مراقبت از دیگران باشند. همچنین بسیار تمایل دارید تا به حل مشکلات پرداخته و بحث‌ها را هدایت کنید.'
    elif name == 'Enterprising':
        return 'کار آفرین', 'شما فردی پر انرژی و ماجراجو هستید. همچنین، به نظر می‌رسد که به قدرت و دارایی‌های مادی، علاقمند باشید. می‌توان گفت که شما فردی هستید که از لحاظ کلامی، در رهبری کردن، توانا می‌باشید. در اغلب موارد، شما خواهان موقعیت‌های رهبری، قدرت و مقام بوده و از کار کردن با دیگران و رهبری آنها به سوی اهداف سازمان یافته لذت می‌برید. شما، به خطر کردن در حیطه‌های بین فردی، تمایل دارید. به طور کلی، شما از انجام فعالیت‌ها و مشاغلی لذت می‌برید که با تشویق و ترغیب دیگران، در ارتباط باشند. همچنین در اغلب موقعیت‌ها، علاقمند به هدایت کمیته‌ها، گروه‌ها، سازمانها یا کمپانی‌ها هستید. به طور کلی، به نظر می‌رسد موقعیت‌هایی برای شما مناسب هستند که دربردارنده ی جایگاه‌های قدرت باشند.'
    elif name == 'Conventional':
        return 'قراردادی', 'شما اغلب به جای خیال پردازی دست به کار می‌شوید و از این منظر می‌توان شما را فردی عمل گرا دانست. شما در کارهای خود معمولاً دقیق، منظم و مرتب هستید. شما اگرچه در انجام وظایف محوله، مسلط و خودکفا هستید، با این حال در مورد دارایی‌های مالی و پولی معمولاً با احتیاط عمل می‌کنید. می‌توان گفت که شما فعالیت‌هایی را دوست دارید که نیاز به سازماندهی و دقت دارند و اغلب از فعالیت‌هایی که شامل مدیریت اطلاعات می‌شوند لذت می‌برید. به طور کلی مشاغل اداری و حوزه‌های فعالیت مرتبط با سازمان‌های بزرگ، تهیه جدول‌ها و نمودارها و وارد کردن داده‌های مربوط به نامه‌ها و گزارش‌ها به کامپیوتر و کنترل کیفی برای شما مناسب است.'


# The Clifton quiz info needed

def get_clifton_strategic(data):
    Analytical = data["Analytical"] / 11
    Context = data["Context"] / 4
    Intellection = data["Intellection"] / 11
    Ideation = data["Ideation"] / 7
    Input = data["Input"] / 5
    Strategic = data["Strategic"] / 4
    Learner = data["Learner"] / 8
    Futuristic = data["Futuristic"] / 8
    explain = ''
    if Analytical >= 2:
        explain += "شما فردی هستید که دلایل پدیده‌ها را بررسی کرده و به دنبال کشف الگو‌ها و روابط میان پدیده‌ها هستید و "
    else:
        explain += "شما فردی هستید که علت وقوع و روابط میان پدیده‌ها ، برای شما جذابیت چندانی ندارد و "
    if Context >= 2:
        explain += "با نگاه به گذشته و تحلیل آن ، به دنبال پاسخ دادن به مسائل حال هستید و "
    else:
        explain += "اتفاقاتی که در گذشته رخ داده است الهام بخش شما برای حل مسائل کنونی نیست و "
    if Futuristic >= 2:
        explain += "و در نهایت شما فردی هستید که مدام مشغول رویاپردازی و برنامه ریزی برای آینده هستید. "
    else:
        explain += "و در نهایت شما فردی هستید که در حال زندگی کرده و انرژی خود را صرف رویاپردازی نمی‌کنید. "
    if Ideation >= 2:
        explain += "دیگران شما را فردی خلاق و باهوش توصیف میکنند و شما از تحلیل مسائل پیچیده لذت می‌برید. "
    else:
        explain += "شما به دنبال کشف مسائل پیچیده و ایده پردازی درباره آنها نیستید. "
    if Input >= 2:
        explain += "ضمنا به نظر می‌رسد شما از جمع‌آوری و آرشیو کردن اطلاعات و داده‌های مختلف لذت می‌برید و ممکن است اطلاعات، ایده‌ها، آثار باستانی یا هر چیز دیگری را بایگانی کنید که این ،بستگی به علاقه‌‌مندی‌های شما دارد. "
    else:
        explain += "ضمنا به نظر می‌رسد شما علاقه ای به جمع آوری اطلاعات و آرشیو کردن آن‌ها نداشته و ترجیح می‌دهید از اطلاعات موجود نهایت استفاده را ببرید. "
    if Learner >= 2:
        explain += "و می‌توان گفت عاشق یاد گرفتن هستید و می‌خواهید به طور مداوم رشد و بهبود پیدا کنید "
    else:
        explain += "و می‌توان گفت از آموختن مطالب جدید لذت چندانی نمی‌برید و جز در مواقع لزوم از یادگیری مطالب و موضوعات جدید امتناع می‌کنید "
    if Intellection >= 2:
        explain += "فکر کردن به مسائل مختلف و محیط پیرامون برای شما کار لذت بخشی است و "
    else:
        explain += "فکر کردن به مسائل مختلف و محیط پیرامون برای شما کار کسالت بار و اذیت کننده ایست "
    if Strategic >= 2:
        explain += " همچنین بررسی نتایج آزمون شما نشان دهنده این است که شما در موقعیت‌های مختلف سناریو‌های متفاوتی را بررسی کرده وعواقب وقوع هر یک را تحلیل می‌کنید."
    else:
        explain += "همچنین بررسی نتایج آزمون شما نشان دهنده این است که ترجیح می‌دهید در هنگام وقوع یک رخداد محتمل ترین سناریو ممکن را انتخاب کرده و بر مبنای آن تصمیم گیری کنید."
    return explain


def get_clifton_relation(data):
    Adaptability = data["Adaptability"] / 8
    Connectedness = data["Connectedness"] / 8
    Developer = data["Developer"] / 10
    Empathy = data["Empathy"] / 6
    Harmony = data["Harmony"] / 5
    Includer = data["Includer"] / 7
    Individualization = data["Individualization"] / 6
    Positivity = data["Positivity"] / 12
    Relator = data["Relator"] / 8
    explain = ''
    if Adaptability >= 2:
        explain += "بررسی نتایج آزمون شما نشان دهنده آن است که شما فردی هستید که معمولا با جریان حرکت می‌کنید و میتوان گفت فردی منعطف و سازگار با محیط و شرایط هستید "
    else:
        explain += "بررسی نتایج آزمون شما نشان دهنده آن است که شما فردی هستید که خیلی با محیط و شرایط مختلف سازگار نیستید و انعطاف پذیری کمی‌دارید"
    if Connectedness >= 2:
        explain += "و اعتقاد دارید که هیچ رخدادی اتفاقی نیست و هر رویه ای دارای معنایی خاص می‌باشد و انسانی ملاحظه گر، دلسوز ، پذیرا و معتقد هستید "
    else:
        explain += "و از نظر شما بعضی از رویداد‌ها می‌تواند تصادفی باشد و الزاما ارتباط خاص و معناداری میان تمامی‌انسان‌ها و رویداد‌ها وجود ندارد "
    if Developer >= 2:
        explain += "و همچنین به نظر می‌رسد شما فردی هستید که پیشرفت کردن و رشد وپرورش دادن خود و دیگران به میزان زیادی برایتان اهمیت دارد و هر چالش را فرصتی جدید دیده و از آن استقبال می‌کنید "
    else:
        explain += "و همچنین به نظر می‌رسد ازمواجهه با چالش‌های جدید پیش رو در زندگی و یا کارتان احساس نگرانی می‌کنید و از موقعیت فعلی که دارید تا حدودی راضی هستید ، ضمنا رشد و پرورش دادن افراد برای شما کار جذابی نیست. "
    if Empathy >= 2:
        explain += " شما خیلی خوب می‌توانید خودتان را در جای دیگران بگذارید و احساسات آن‌ها را درک کنید. شما می‌توانید جهان را از چشم‌های دیگران ببینید؛ نه اینکه لزوماً با دیدگاه هر کسی موافق باشید و یا برای هر کسی ترحم و دلسوزی کنید (این با همدلی فرق می‌کند) اما آن‌ها را می‌فهمید. "
    else:
        explain += "گاهی اوقات شما دوستان و اطرافیانتان را به خوبی درک نمی‌کنید و نمی‌توانید خود را جای آن‌ها قرار داده و دلیل رفتار‌ها و نوع نگاهشان به موضوعات را متوجه شوید و گاها از خود می‌پرسید چرا آن‌ها اینگونه که باید رفتار و یا فکر نمی‌کنند؟. "
    if Harmony >= 2:
        explain += "همچنین فردی هستید صلح جو که از درگیری با دیگران لذت نمی‌برید و سعی می‌کنید اصطکاک را به حداقل برسانید و به دنبال پیدا کردن زمینه‌های مشترک در افراد هستید "
    else:
        explain += "همچنین در اصطکاک‌هایی که در مسیر زندگی و تعامل با دیگران به وجود می‌آید با وجود اینکه از این اصطکاک‌ها لذت نمی‌برید ولی معمولا قدم خاصی برای برطرف کردن آن‌ها برنمی‌دارید و به دنبال پیدا کردن زمینه‌های مشترک در افراد مختلف نیستید "
    if Includer >= 2:
        explain += "شما فردی هستید که از قضاوت کردن دیگران امتناع کرده و سعی می‌کنید در مسائل مختلف به نظرات مخالف خود نیز گوش کنید و از اینکه فردی داخل یک گروه دوستی یا کاری منفعل باشد اذیت می‌شوید "
    else:
        explain += "همینطور در مورد ویژگی‌های شما در این حوزه می‌توان به این موضوع اشاره کرد که ذهن شما احتمالا ذهنی قضاوت گر بوده و خیلی به نظرات متفاوت با نظر خود بها نداده و آن را اشتباه می‌داند و ممکن است به همین دلیل در کارهای گروهی تعدادی از اعضا را در فرآیند‌های تیمی‌نادیده بگیرید "
    if Individualization >= 2:
        explain += "و همچنین به تفاوت‌های فردی افراد توجه دارید و نقاط قوت و ضعف آن‌ها را به خوبی شناسایی کرده و متناسب با آن اقدام می‌کنید "
    else:
        explain += "و از دید شما کار و عقیده درست در هر حوزه معنی و مفهوم ثابت و مشخصی دارد و باید آنگونه رفتار کرد که درست است نه متناسب با روحیه و عقاید افراد مختلف "
    if Positivity >= 2:
        explain += "به نظر می‌رسد فرد خوش بینی هستید که می‌تواند دیگران را هیجان‌زده کند. راحت لبخند می‌زنید و همیشه دنبال نیمه مثبت ماجرا هستید "
    else:
        explain += "همچنین به نظر می‌رسد فرد واقع گرایی هستید و در امور مختلف علاوه بر نیمه پر لیوان قسمت خالی و بدبینانه آن را هم دیده و به آن توجه دارید "
    if Relator >= 2:
        explain += " و در نهایت از بودن در کنار دیگران و دوستانتان لذت می‌برید و فردی هستید صمیمی‌که از ملاقات با افراد جدید و ایجاد رابطه با آن‌ها استقبال می‌کنید"
    else:
        explain += "و در نهایت می‌توان گفت شما احتمالا دایره ای از دوستان صمیمی‌ولی به تعداد کم دارید و ترجیح می‌دهید خیلی با افراد جدیدی که کمتر آن‌ها را می‌شناسید ارتباط برقرار نکنید"
    return explain


def get_clifton_infiltrate(data):
    Activator = data["Activator"] / 7
    Command = data["Command"] / 9
    Communication = data["Communication"] / 9
    Competition = data["Competition"] / 9
    Significance = data["Significance"] / 12
    Maximizer = data["Maximizer"] / 7
    Woo = data["Woo"] / 9
    Self_assurance = data["Self_assurance"] / 13
    explain = ''
    if Activator >= 2:
        explain += "بررسی نتایج آزمون شما نشان دهنده آن است که شما فردی عملگرا بوده و به سرعت می‌توانید ایده‌ها و تصمیمات خود را به مرحله اجرا دربیاورید به عبارت دیگر شما صمیم می‌گیرید، اقدام می‌کنید، نتیجه را بررسی می‌کنید و تجربه کسب می‌کنید. و این فرایند اقدام بعدی‌ شما را آگاهانه‌تر می‌کند "
    else:
        explain += "بررسی نتایج آزمون‌های شما نشان دهنده آن است که شما ترجیح می‌دهید قبل از عملی کردن ایده‌های خود، ترجیح می‌دهید جوانب مختلفی را مورد بررسی قرار دهید و بعد ایده‌های خود را عملی کنید. همچنین به نظر می‌رسد شما ترجیح می‌دهید ایده پرداز تیم خود باقی بمانید و عملی کردن ایده‌های خود را به دیگران بسپارید "
    if Command >= 2:
        explain += "و فردی هستید تا حدودی کنترل گر که می‌تواند نظرات خود را به دیگران تحمیل کند و پس از همراه کردن دیگران با خود احساس رضایت دارید ، این روحیه بعضا در مدیریت و رهبری افراد کاربرد زیادی دارد "
    else:
        explain += "و فردی هستید که معمولا نظرات خود را به دیگران تحمیل نمی‌کنید و این کار برای شما سخت و بعضا آزاردهنده است و برای مثال در کارهای گروهی بجای تحمیل کردن نظر خود به دیگران، ترجیح می‌دهید با آن‌ها همراه شوید و از نظر جمع تبعیت کنید "
    if Communication >= 2:
        explain += "و به نظر می‌رسد شما می‌توانید به راحتی افکار خود را در کلمات قرار ‌دهید. احتمالاً باید مکالمه‌گر و مجری خوبی باشید. در حقیقت دوست دارید توضیح بدهید، توصیف کنید و ایده‌ها و افکارتان را به کمک تصاویر و مثال‌ها و استعاره‌ها زنده کنید. "
    else:
        explain += "و به نظر می‌رسد شما ایده‌هایی در سر دارید که تبدیل کردن آن ایده‌ها به کلمات برای شما دشوار است "
    if Competition >= 2:
        explain += "همچنین ظاهرا بیشتر اوقات درحال مقایسه توانایی‌ها و عملکرد خود با دیگرانید. همیشه در رقابت‌ها شرکت می‌کنید و تلاش می‌کنید مقام اول را به‌ دست بیاورید. و اگر از دیگران پیشی نگیرید ممکن است احساس پوچی کنید "
    else:
        explain += "همچنین ظاهرا بیشتر اوقات از مقایسه کردن خود با دیگران امتناع می‌کنید همچنین اگر شخص دیگری این کار را انجام دهد برای شما آزار دهنده است. شما بیشتر سعی می‌کنید از انجام کار‌ها لذت ببرید و  الزاما رقابت کردن و برتری نسبت به دیگران برای شما اهمیتی ندارد "
    if Maximizer >= 2:
        explain += "و همچنین فردی هستید ایده آل گرا و کمال طلب که اکثر اوقات مجذوب نقاط قوت می‌شوید؛ حتی اگر نقاط قوت شما نباشند.تعالی بی‌اندازه و یادگیری سریع از ویژگی‌های شماست. و اینکه ترجیح می‌دهید با کسانی وقت بگذرانید که نقاط قوت شما را تمجید می‌کنند. "
    else:
        explain += "همچنین فرد ایده آل گرایی نیستید که این موضوع تا حدی برای شما آرامش به ارمغان می‌آورد و از اینکه کاری را تا حد خوبی و با کیفیت معقول و متناسب انجام دهید احساس رضایت می‌کنید و نیازی به عالی انجام دادن آن نمی‌بینید "
    if Self_assurance >= 2:
        explain += "و در انتها می‌توان گفت اعتماد بنفس قابل قبولی دارید به طوری که در اکثر اوقات توانایی‌ها و تصمیمات خود را باور دارید و معمولا تصمیم گیرنده نهایی در امور مختلف خودتان هستید "
    else:
        explain += "و در انتها می‌توان گفت که در اکثر مواقع نسبت به تصمیمیاتی که مستقلا می‌گیرید دچار شک و تردید می‌شوید و سعی می‌کنید نظرات و تصمیمات خود را ابتدا با دیگران در میان بگذارید و در نهایت تصمیمی‌را اتخاذ کنید که پشتوانه دیگران را نیز داشته باشد "
    if Significance >= 2:
        explain += "ضمنا به نظر می‌رسد شما دوست دارید که تأثیرگذار باشید. مستقل بودن از صفات بارز شماست و احساس می‌کنید که باید معتبر، حرفه‌ای و موفق باشید و با چنین آدم‌هایی هم در ارتباط باشید. "
    else:
        explain += "ضمنا به نظر می‌رسد بیشتر انسان تاثیر پذیری باشید تا تاثیرگذار و داشتن استقلال در موضوعات مختلف برای شما دغدغه چندانی نیست"
    if Woo >= 2:
        explain += "دوستی و دوست یابی جزء ویژگی‌های شاخص شماست به طوریکه علاقه مند به دیدن افراد جدید و  ایجاد ارتباط با آن‌ها هستید. "
    else:
        explain += "دوستی و دوستیابی برای شما کار چندان ساده ای نیست و احتمالا ترجیح می‌دهید با افرادی دوست باشید که کاملا آن‌ها را می‌شناسید و با آن‌ها احساس راحتی می‌کنید "
    return explain


def get_clifton_executive(data):
    Achiever = data["Achiever"] / 6
    Consistency = data["Consistency"] / 8
    Arranger = data["Arranger"] / 13
    Responsibility = data["Responsibility"] / 11
    Belief = data["Belief"] / 11
    Focus = data["Focus"] / 12
    Deliberative = data["Deliberative"] / 8
    Discipline = data["Discipline"] / 14
    Restorative = data["Restorative"] / 6
    explain = ''
    if Achiever >= 2:
        explain += "بررسی نتایج آزمون‌های شما نشان دهنده آن است که شما فردی هستید که می‌توانید خیلی سخت کار کنید و استقامت زیادی داشته باشید . بنابراین شاید همیشه باید با این احساس نارضایتی زندگی کنید که، کاری که انجام می‌دهید کافی نیست. ولی خب این موضوع باعث می‌شود انرژی لازم برای کار در ساعات طولانی را برای رسیدن به اهدافتان داشته باشید. "
    else:
        explain += "بررسی نتایج آزمون‌های شما نشان دهنده آن است که که شما فرد پرکار و پرتلاشی نیستید و انجام کارهای طولانی و سخت برای شما طاقت فرسا و خسته کننده است و ترجیح می‌دهید با کمترین کار ممکن، بهترین نتیجه را از نظر خود بگیرید "
    if Arranger >= 2:
        explain += "ظاهرا شما در وضعیت‌های پیچیده، وقتی که همه احساس سردرگمی‌می‌کنند، از مدیریت متغیرها و تنظیم آن‌ها لذت می‌برید و همیشه می‌خواهید که بهترین راه را برای انجام کارها پیدا کنید. و  فردی هستید انعطاف پذیر و سازنده. "
    else:
        explain += "ظاهرا شما در وضعیت‌های پیچیده و مبهم، انتخاب می‌کنید که مدیریت را به دیگران بسپارید و تصمیم گیر بودن در این شرایط برای شما نگران کننده بوده و حفظ نظم موجود و حضور در شرایط قابل فهم و با ثبات را ترجیح می‌دهید "
    if Belief >= 2:
        explain += " و ارزش‌هایی دارید که تغییرناپذیرند. این ارزش‌ها اکثراً خانوده محور، معنوی، اخلاقی و یا مسئولیت‌پذیری هستند. و معمولا به دنبال کارهایی هستید که فارغ از درآمد و جایگاه با ارزش‌های شما نیز هم راستا باشند. "
    else:
        explain += "و معمولا ارزش‌ها برای شما پایدار و بدون تغییر نیستند و در شرایط و زمان‌های مختلف ممکن است این ارزش‌ها تغییر کنند یا نادیده گرفته شوند "
    if Consistency >= 2:
        explain += "هم چنین به نظر می‌رسد شما کاملاً معتقید که باید با مردم، بدون توجه به جایگاهی که دارند، همیشه یکسان و باثبات رفتار کرد و همیشه با رویه و چارچوب ثابت خودتان با تمامی‌افراد رفتار می‌کنید و احتمالا از پارتی بازی متنفر هستید "
    else:
        explain += "همچنین به نظر می‌رسد شما معمولا با افراد مختلفی که دارای جایگاه اجتماعی و شرایط متفاوتی هستند متناسب با جایگاه آن فرد رفتار می‌کنید و به نظر شما باید با هر فرد متقابلا با توجه به رفتار او رفتار کرد "
    if Deliberative >= 2:
        explain += "همچنین شما به عنوان کسی که در هر موقعیتی بهترین تصمیم را می‌گیرد، توصیف می‌شوید. بسیار مراقب و هشیار هستید و می‌توانید موانع را پیش‌بینی کنید. "
    else:
        explain += "همچنین ممکن شما در موقعیت‌های مختلف تصمیماتی را اتخاذ کنید که تمامی‌جوانب آن را در نظر نگرفته اید و این موضوع می‌تواند گاها برای شما دردسر ساز باشد "
    if Discipline >= 2:
        explain += "شما فردی منظم هستید که از روتین و ساختارها لذت می‌برید "
    else:
        explain += "همچنین شما فردی هستید که بی نظمی‌و نبود ساختار منظم در موضوعات مختلف برایتان آزاردهنده نیست "
    if Focus >= 2:
        explain += "از دیگر ویژگی‌های شما می‌توان به تمرکز نسبتا بالای شما در حرکت به سمت اهدافتان اشاره کرد به صورتی که شما معمولا اهداف خود و امور مختلف را اولویت بندی کرده و سپس به سمت آنها حرکت می‌کنید "
    else:
        explain += "به نظر می‌رسد که شما در مسیر رسیدن به اهداف خود تمرکز می‌کنید اما عوامل بیرونی و درونی به راحتی تمرکز شما را از بین می‌برند "
    if Responsibility >= 2:
        explain += "ضمنا شما نسبت به آنچه می‌گویید مسئول هستید و البته متعهد به ارزش‌هایی مثل صداقت ، وفاداری و مسئولیت پذیری می‌باشید. "
    else:
        explain += "درضمن احتمالا برایتان پیش آمده که در شرایطی صحبت خود یا وعده ای که به کسی داده اید را فراموش کرده باشید و یا از انجام دادن کاری تا انتها خسته شده و آن را نیمه رها کرده باشید "
    if Restorative >= 2:
        explain += "و در نهایت می‌توان گفت در برخورد با مشکلات، مهارت بی‌نظیری دارید. متخصص کشف مشکلات و علل آن‌ها هستید. و در حالی که دیگران از شکست خود احساس ناراحتی می‌کنند، شما در چنین شرایطی انرژی گرفته و از یافتن راه‌حل لذت می‌برید. "
    else:
        explain += "و در نهایت می‌توان گفت شکست‌ها می‌توانند برای شما نقطه پایان باشند و در مواجهه با مشکلات معمولا کار را رها کرده و به دنبال مسیر جایگزین برای موفقیت نیستید "
    return explain


# Quiz 2 report info

def personality_info(data):
    Extraversion = data["Extraversion"]
    Connectedness = data["Connectedness"]
    Competition = data["Competition"]
    Self_assurance = data["Self_assurance"]
    Body_kinesthetic = data["Body_kinesthetic"]
    Neuroticism = data["Neuroticism"]
    Agreeableness = data["Agreeableness"]
    explain = ''
    if Extraversion <= 15:
        explain += "شما آدم درونگرایی هستید و تنهایی خود را به جمع های شلوغ ترجیح میدهید و یا ترجیح میدهید تعداد کمی دوست داشته باشید تا در صورت نیاز با آن‌ها وقت بگذارنید و "
    elif 16 <= Extraversion <= 33:
        explain += "شما آدم میانه گرایی هستید ، تعدادی از ویژگی های برونگرایی را دارید و برخی از رفتارهای درونگراها را نیز بروز می دهید. گاهی از بودن در جمع احساس خوبی دارید و در مواردی تنهایی را به جمع ترجیح میدهید و "
    else:
        explain += "شما آدم برونگرایی هستید و بودن در جمع افرادی که با آن‌ها ارتباط دارید را ترجیح می دهید و انرژی روانی خود را از بودن در کنار آدم‌ها بدست می آورید و تجدید می کنید و بودن با آن‌ها را به تنهایی ترجیح می دهید و "
    if Connectedness <= 12:
        explain += "به نظر می رسد شما فردی هستید که توانایی انجام کار های گروهی و جمعی را ندارید یا برای مثال از تفریح های انفرادی لذت می برید و ترجیح می دهید با یک جمع خصوصی و صمیمی ارتباط داشته باشید و "
    elif 13 <= Connectedness <= 24:
        explain += "به نظر می رسد شما فردی هستید که توانایی انجام کار های گروهی و جمعی را تا حدی دارید ، از تفریح های انفرادی لذت می برید و در عین حال می توانید با جمع های مختلف ارتباط برقرار کنید و "
    else:
        explain += "به نظر می رسد شما فردی هستید که توانایی انجام کار های گروهی و جمعی را دارید یا برای مثال از تفریح های گروهی لذت می برید و می توانید با جمع های مختلف ارتباط برقرار کنید و "
    if Competition <= 10:
        explain += "اهل رقابت نیستید و سعی می کنید بجای رقابت کردن با دیگران و یا تبدیل هر پدیده به صحنه یک مسابقه، تلاش کنید تا در صلح و آرامش به اهداف خود برسید و از آرامش خود استفاده کنید و "
    elif 11 <= Competition <= 21:
        explain += "گاهی اهل رقابت نیستید و گاهی از رقابت لذت میبرید ، در مواردی سعی می کنید بجای رقابت کردن با دیگران و یا تبدیل پدیده به صحنه یک مسابقه، تلاش کنید تا در صلح و آرامش به اهداف خود برسید و از آرامش خود استفاده کنید و گاهی نیز رقابت یرایتان جالب است و از آن استقبال میکنید و "
    else:
        explain += "اهل رقابت هستید و سعی می کنید کارهای خود را در فضای رقابت کردن با دیگران و یا تبدیل هر پدیده به صحنه یک مسابقه انجام دهید، تلاش کنید تا دریک رقابت به اهداف خود برسید و آرامش خود را در دل رقابت به دست می آورید و "
    if Self_assurance <= 19:
        explain += "نتایج آزمون های شما گویای این است که در زندگی خود اتفاقات و یا روابطی داشته اید که آسیب هایی جدی به اعتماد به نفس شما زده شده است و در موارد بسیاری خودتان را فرد شایسته و کارآمدی نمی بینید در مجموع از مقدار کمی اعتماد به نفس و خودباوری برخوردار هستید و "
    elif 20 <= Self_assurance <= 39:
        explain += "نتایج آزمون های شما گویای این است که در زندگی خود اتفاقات و یا روابطی داشته اید که آسیب هایی با اعتماد به نفس شما زده شده است اما این آسیب‌ها جدی نبوده یا از منابع جایگزین اعتماد به نفس خود را بهبود بخشیده اید و در مجموع از مقدار متوسطی اعتماد به نفس و خودباوری برخوردار هستید و "
    else:
        explain += "نتایج آزمون های شما گویای این است که برای انجام کارها به راحتی میتوانید پیش قدم شوید و در موارد بسیاری خودتان را فرد شایسته و کارآمدی می بینید در مجموع از مقدار بالای اعتماد به نفس و خودباوری برخوردار هستید و "
    if Body_kinesthetic <= 18:
        explain += "همچنین به نظر می رسد فعالیت های فیزیکی و فعالیت های جسمی و حرکتی برای شما جذاب نبوده و ترجیح میدهید فعالیت های دقیق و حساس فیزیکی نداشته باشید و "
    elif 19 <= Body_kinesthetic <= 37:
        explain += "همچنین به نظر می رسد فعالیت های فیزیکی و فعالیت های جسمی و حرکتی برای شما گاهی جذاب بوده ولی در برخی موارد ترجیح میدهید فعالیت های فیزیکی دقیق و حساس نداشته باشید و "
    else:
        explain += "همچنین به نظر می رسد فعالیت های فیزیکی و فعالیت های جسمی و حرکتی برای شما بسیار جذاب بوده و ترجیح میدهید فعالیت های فیزیکی مختلف و متنوع داشته باشید و "
    if Neuroticism <= 15:
        explain += "و نتایج آزمون های شما نشان می دهد فرد اضطرابی نیستید و یا اتفاقات کوچک نمی تواند ثبات هیجانی شما را دچار مشکل کند و سعی می کنید در سخت ترین شرایط آرامش خود و ثبات خود را حفظ کنید و بهم ریختگی نداشته باشید و یا اگر دارید، بر کارایی و عملکرد شما تاثیر بسزایی نداشته باشد و "
    elif 16 <= Neuroticism <= 33:
        explain += "و نتایج آزمون های شما نشان می دهد فردی با حد اضطراب متوسط هستید و  اتفاقات کوچک معمولا نمی تواند ثبات هیجانی شما را دچار مشکل کند ولی ممکن است گاهی دچار بهم ریختگی شوید و این بهم ریختگی می تواند فعالیت شما و کارایی شما را دچار مشکل نماید و "
    else:
        explain += "اما نتایج آزمون های شما نشان می دهد فرد اضطرابی هستید و یا اتفاقات کوچک می تواند ثبات هیجانی شما را دچار مشکل می کند و ممکن است سریع دچار بهم ریختگی شوید و این بهم ریختگی می تواند فعالیت شما و کارایی شما را دچار مشکل نماید و "
    if Agreeableness <= 15:
        explain += "در نهایت به نظر می رسد شما فرد تبعیت پذیری نیستید، تبعیت پذیری می تواند دلایل و عوامل مختلفی داشته باشد اما برای شما این تبعیت پذیر نبودن به این معناست که باور های خود را قبول دارید و باور دارید چیزی که به ذهن شما می رسد درست است و کسی نمی تواند به اندازه شما درباره درستی یا غلط بودن یک موضوع نظر دهد."
    elif 16 <= Agreeableness <= 33:
        explain += "در نهایت به نظر می رسد شما فردی با میزان متوسط تبعیت پذیری هستید، این میزان تبعیت پذیری شما می تواند دلایل و عوامل مختلفی داشته باشد اما برای شما این تبعیت پذیر بودن به این معناست که باور های خود را قبول دارید و در عین حال باور دارید چیزی که به ذهن شما می رسد ممکن است نادرست باشد و گاهی دیگران بهتر از شما درباره درستی یا غلط بودن یک موضوع نظر می دهند."
    else:
        explain += "در نهایت به نظر می رسد شما فرد تبعیت پذیری هستید، تبعیت پذیری شما می تواند دلایل و عوامل مختلفی داشته باشد اما برای شما این تبعیت پذیر بودن به این معناست که باور های خود را قبول ندارید و یا زمانی برای پروراندن این باورها برای خود صرف نمی کنید و باور دارید چیزی که به ذهن شما می رسد ممکن است نادرست باشد و در اغلب موارد دیگران بهتر از شما درباره درستی یا غلط بودن یک موضوع نظر می دهند."
    return explain


def get_fields_matches(score):
    if score >= 80:
        return "خیلی زیاد", "4ddb4d"
    elif 60 <= score < 79:
        return 'زیاد', '94ff94'
    elif 40 <= score < 59:
        return 'متوسط', 'ffff94'
    elif 20 <= score < 39:
        return 'کم', 'ffb870'
    else:
        return 'خیلی کم', 'db4d4d'
